Repository: 5c0rp264/C-Project
Catalog: EasySave/EasySave_graphical/Properties/Resources.*.resx
Languages: ar, he

source: About
ar: بالمناسبة
he: על אודות

source: Add
ar: اضافه
he: לְהוֹסִיף

# all_good
source: Everything went well
ar: كل شيء سار على ما يرام
he: הכל התנהל כשורה

source: Business Software
ar: برامج الأعمال
he: תוכנה עסקית

# business_software_error
source: A business process is running, we can't start the backup job
ar: برامج الأعمال قيد الاستخدام، لا يمكننا بدء العمل النسخ الاحتياطي
he: תוכנה עסקית נמצאת בשימוש, איננו יכולים להתחיל בעבודת גיבוי

source: Delete
ar: للقضاء علي
he: לְהַסִיר

# delete_check
source: Do you really want to delete the following backup job :
ar: هل تريد بالتأكيد حذف عمل النسخ الاحتياطي التالي:
he: האם אתה בטוח שברצונך למחוק את עבודת הגיבוי הבאה:

# delete_confirm
source: We have successfully deleted the following backup job :
ar: لقد قمنا بإزالة عمل النسخ الاحتياطي التالي:
he: מחקנו את עבודת הגיבוי הבאה:

# delete_label
source: Select a backup job to delete
ar: تحديد عمل النسخ الاحتياطي لحذفه
he: בחר עבודת גיבוי למחיקה

# delete_warning
source: You need to select a backup job
ar: تحتاج إلى تحديد مهمة النسخ الاحتياطي
he: עליך לבחור משרת גיבוי

source: Destination
ar: الوجهة
he: יַעַד

source: Differential
ar: التفاضليه
he: דִיפֵרֶנציִאָלִי

source: Edit
ar: تحرير
he: לַעֲרוֹך

source: Error
ar: الخطا
he: אשמה

# error_message1
source: The type of the backup job is not set
ar: نوع النسخ الاحتياطي مفقود
he: סוג הגיבוי חסר

# error_message2
source: A backup work needs a name to be identified
ar: مطلوب اسم عمل النسخ الاحتياطي ليتم تعريفه
he: יש לזהות את שם עבודת הגיבוי

# error_message3
source: The source folder is not set
ar: المجلد المصدر مفقود
he: תיקיית המקור חסרה

# error_message4
source: The destination folder is not set
ar: المجلد الوجهة مفقود
he: תיקיית היעד חסרה

source: Execute
ar: تشغيل
he: לבצע

# execute_label
source: Select the backup jobs to execute
ar: تحديد المهام التي سيتم إنجازها
he: בחר את המשרות להפעלה

# execute_warning
source: You need to select at least one backup
ar: تحتاج إلى تحديد وظيفة واحدة على الأقل
he: עליך לבחור משרה אחת לפחות

# extension
source: Extension to encrypt : (.png,.txt,.mp3...)
ar: ملحق التشفير: (.png,.txt,.png)
he: הרחבה להצפנה: (.png, .txt, .png)

# file_priority
source: Priority files (.png,.txt,.png)
ar: ملفات الأولوية (.png,.txt,.png)
he: קבצי עדיפות (.png, .txt, .png)

source: Full
ar: كامله
he: לְהַשְׁלִים

source: Home
ar: الصفحة الرئيسية
he: בית

source: Information
ar: المعلومات
he: מֵידָע

source: Log
ar: صحيفه
he: עיתון

source: Name :
ar: اسم:
he: שם משפחה :

source: Pause
ar: كسر
he: הַפסָקָה

source: Please :
ar: الرجاء:
he: אנא :

# reference
source: Please enter a full backup of reference :
ar: الرجاء إدخال نسخة احتياطية كاملة المرجع:
he: אנא הכנס גיבוי מלא להפניה:

source: Save
ar: لحفظ
he: להציל

# select_label
source: Choose a backup job
ar: اختيار وظيفة
he: בחר עבודה

source: Settings
ar: معلمات
he: הגדרות

# size_limit
source: Maximum file size in case of simultaneous transfers
ar: الحد الأقصى لحجم الملف لعمليات النقل المتزامنة
he: גודל קובץ מרבי במקרה של העברות בו זמנית

# size_unit
source: kb
ar: كيلو بايت
he: קו

source: Source
ar: مصدر
he: מָקוֹר

source: State
ar: الدوله
he: מדינה

source: Stop
ar: وقف
he: תפסיק

# success
source: Added with success
ar: تمت الإضافة بنجاح
he: נוסף בהצלחה

# thread_stop
source: Every backup jobs were aborted
ar: تم إيقاف كافة النسخ الاحتياطية
he: כל הגיבויים הופסקו
